import 'package:project2/assignment2/model/general_model.dart';

class QuizData {
  static final List<Question> general2questions = [
    Question(
      id: 16,
      question:
      "នៅពេលយប់មានភ្លើងហ្វារថយន្តចាំងពីមុខ តើអ្នកបើកបរត្រូវធ្វើដូចម្ដេច?",
      answer1: "ក- ត្រូវបើកបរក្នុងល្បឿនសមល្មម ហើយបើកអែបស្ដាំបំផុត",
      answer2:
      "ខ- មិនចាំបាច់បន្ថយល្បឿនទេ ព្រោះខ្ញុំទំលាក់របាំងការពារពន្លឺថ្ងៃ ព្រោះខ្ញុំយល់ថាយានមកមុខក៏ឃើញខ្ញុំដែរ",
      answer3: "គ- បើកភ្លើងរថយន្តចាំងខ្លាំង ខ្ញុំត្រូវបើកហ្វាតបទៅរថយន្តនោះវិញ",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 17,
      question:
      "រថយន្តមួយកំពុងធ្វើចរាចរលើផ្លូវជាតិ និងរថយន្តទៀតចេញពីផ្លូវលំ តើរថយន្តណាមួយមានសិទ្ធិអាទិភាព?",
      answer1: "ក- រថយន្តចេញពីផ្លូវលំមានសិទ្ធិអាទិភាព",
      answer2: "ខ- រថយន្តកំពុងធ្វើចរាចរនៅលើផ្លូវជាតិមានសិទ្ធិអាទិភាព",
      answer3: "គ- រថយន្តទាំងពីរមានសិទ្ធិស្មើគ្នា",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 18,
      question:
      "តាមបណ្ដោយផ្លូវមានគំនូសសញ្ញាភ្លោះពណ៌លឿង មួយជាប់ និងមួយដាច់ៗ បែងចែកជាពីរទិសចរាចរ ផ្ទុយគ្នា តើអ្នកបើកបរនៅកៀកគំនូសណាមួយអាចឆ្លងកាត់ ឬជែងបាន?",
      answer1: "ក- អ្នកបើកបរនៅកៀកគំនូសជាប់ អាចឆ្លងកាត់ឬជែងបាន",
      answer2: "ខ- អ្នកបើកបរនៅកៀកគំនូសដាច់ៗ អាចឆ្លងកាត់ ឬជែងបាន",
      answer3: "គ- ហាមអ្នកបើកបរឆ្លងកាត់ ឬជែងនៅលើគំនូសដាច់ៗ",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 19,
      question: "តើអ្នកបើកបរយានជំនិះគ្រប់ប្រភេទ ត្រូវជែងគ្នាខាងណា?",
      answer1: "ក- ខាងស្ដាំដៃ",
      answer2: "ខ- ខាងឆ្វេងដៃ",
      answer3: "គ- ខាងណាក៏បាន",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 20,
      question: "នៅពេលជួបប្រទះផ្លាកសញ្ញាហាមចត តើអ្នកអាចឈប់បានឬទេ?",
      answer1: "ក- អាចឈប់បាន",
      answer2: "ខ- អាចឈប់បានតែថ្ងៃអាទិត្យ",
      answer3: "គ- មិនអាចឈប់បានទេ",
      correctAnswer: 0,
      category: "General question",
    ),
  ];
}
