import 'package:project2/assignment2/model/general_model.dart';

class QuizData {
  static final List<Question> generalquestions = [
    Question(
      id: 1,
      question:
          "ពេលអ្នកបើកបរមកចំណុចកណ្ដាលនៃទ្រូងផ្លូវប្រសព្វ ហើយរៀបបត់ឆ្វេង ដោយធ្វើភ្លើងសញ្ញាបត់ ឆ្វេង ជាប្រចាំ ពេលនោះមានរថយន្តជាច្រើនជាប់គ្នារដឹកមកពីទិសផ្ទុយគ្នា តើអ្នកត្រូវធ្វើយ៉ាងដូចម្ដេច?",
      answer1: "ក- ខ្ញុំត្រូវតែបត់ ព្រោះខ្ញុំធ្វើសញ្ញាបត់ឆ្វេងរួចហើយ",
      answer2:
          "ខ- ខ្ញុំមិនត្រូវបត់ឆ្វេងភ្លាមទេខ្ញុំត្រូវបន្ថយល្បឿន បើចាំបាច់ខ្ញុំឈប់អោយរថយន្ត មកពីមុខទៅផុតអស់ទើបខ្ញុំបត់ឆ្វេង ដោយប្រុងប្រយ័ត្ន",
      answer3: "គ- រថយន្តខ្ញុំរត់មុខគេ ត្រូវតែមានសិទ្ធិអាទិភាពបត់មុនគេ",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 2,
      question: "ពេលអ្នកចតរថយន្ត តើអ្នកត្រូវមានការប្រុងប្រយ័ត្នយ៉ាងដូចម្តេច?",
      answer1:
          "ក- ត្រូវចតខាងស្តាំដៃតាមទិសចរាចរ និងមិនអោយរំខានដល់អ្នកប្រើប្រាស់ផ្លូវ ឬចតនៅចំណតរថយន្តរួចហើយត្រូវដាក់ហ្វ្រាំងដៃ",
      answer2: "ខ- ខ្ញុំត្រូវចតនៅកន្លែងណាដែលស្រលះ",
      answer3: "គ- ខ្ញុំត្រូវចតនូវកន្លែងណាក៏បានដែរ",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 3,
      question:
          "តើក្មេងចាប់ពីអាយុប៉ុន្មានឆ្នាំឡើងទៅ ទើបអនុញ្ញាតអោយអង្គុយនៅកៅអីផ្នែកខាងមុខក្បែរអ្នកបើកបរ?",
      answer1: "ក- ត្រូវមានអាយុចាប់ពី០៥ ឆ្នាំ ពេញបរិបូណ៌ឡើងទៅ",
      answer2: "ខ- ត្រូវមានក្រោម ១០ឆ្នាំ",
      answer3: "គ- ត្រូវមានអាយុចាប់ពី១០ ឆ្នាំ ពេញបរិបូណ៌ឡើងទៅ",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 4,
      question: "តើភ្លើងហ្វា អនុញ្ញាតអោយប្រើនៅពេលណា? កន្លែងណា?",
      answer1: "ក- ភ្លើងហ្វាអនុញ្ញាតអោយប្រើបានគ្រប់ពេល និងគ្រប់ទីកន្លែង",
      answer2:
          "ខ- ភ្លើងហ្វាអនុញ្ញាតឲ្យប្រើនៅពេលយប់ស្ងាត់ គ្មានអគ្គិសនីបំភ្លឺផ្លូវ និងប្រើឆ្លាស់គ្នាជាមួយភ្លើងកូតនៅពេលសុំជែង",
      answer3: "គ- ភ្លើងហ្វាអនុញ្ញាតអោយប្រើនៅក្នុង និងក្រៅក្រុង",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 5,
      question:
          "ការចត ឬឈប់យានជំនិះនៅលើទ្រូងផ្លូវសាធារណៈ ត្រូវបានកំណត់រយៈត្រឹមប៉ុន្មានម៉ោង?",
      answer1: "ក- មិនលើសពី២៤ម៉ោង",
      answer2: "ខ- មិនលើសពី៤៨ម៉ោង",
      answer3: "គ- មិនលើសពី៧២ម៉ោង",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 6,
      question:
          "នៅលើផ្លូវដែលមានភក់ ឬទឹកដក់តើអ្នកបើកបរត្រូវមានការប្រុងប្រយ័ត្នដូចម្តេច? បើមានអ្នកថ្មើរជើងនៅជិតនោះ?",
      answer1: "ក- ខ្ញុំត្រូវបង្កើតល្បឿនអោយផុតពីភក់នោះ",
      answer2: "ខ- ខ្ញុំត្រូវឈប់រង់ចាំរហូតដល់ផ្លូវស្ងួតគ្មានភក់",
      answer3:
          "គ- ខ្ញុំត្រូវបន្ថយល្បឿនតិចៗដោយប្រុងប្រយ័ត្ន កុំអោយខ្ទាតភក់លើអ្នកថ្មើរជើង",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 7,
      question:
          "រថយន្តពន្លត់អគ្គីភ័យ រថយន្តសង្គ្រោះបន្ទាន់ និងរថយន្តនគរបាល ឬយោធា អាវុធហត្ថ ដែលកំពុង បំពេញភារកិច្ច តើរថយន្តណាមួយមានសិទ្ធិអាទិភាព?",
      answer1:
          "ក- ត្រូវឲ្យរថយន្តពន្លត់អគ្គីភ័យទៅមុន បន្ទាប់មករថយន្តសង្គ្រោះបន្ទាន់ រួចរថយន្តសង្គ្រោះ បន្ទាន់ទៅ ក្រោយ",
      answer2:
          "ខ- ត្រូវអោយរថយន្តនគរបាល យោធា អាវុធហត្ថទៅមុន បន្ទាប់មករថយន្តសង្គ្រោះបន្ទាន់ រួច រថយន្តពន្លត់អគ្គិភ័យទៅក្រោយ",
      answer3:
          "គ- ត្រូវអោយរថយន្តអគ្គិភ័យទៅមុន បន្ទាប់មករថយន្តសង្គ្រោះបន្ទាន់ រួចរថយន្តនគរបាល យោធា  អាវុធហត្ថទៅក្រោយ",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 8,
      question:
          "នៅពេលអ្នកបើកបរលើផ្លូវទឹករលក ដោយល្បឿនលឿន តើវាអាចបង្កអោយមានគ្រោះថ្នាក់ដែរ ឬទេ?",
      answer1: "ក- ពុំអាចមានគ្រោះថ្នាក់អ្វីទេ",
      answer2: "ខ- មិនអាចបង្កអោយមានគ្រោះថ្នាក់ដល់អ្នកបើកបរលឿនទេ",
      answer3: "គ- អាចបង្កអោយមានគ្រោះថ្នាក់ដល់អ្នកបើកបរលឿនបាន",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 9,
      question:
          "គំនូសសញ្ញាទោលជាប់សំរាប់បែងចែកទ្រូងផ្លូវជាពីទិសចរាចរផ្ទុយគ្នា តើអ្នកអាចបើកឆ្លងកាត់ ឬជាន់ពីលើបាន ឬទេ?",
      answer1: "ក- អាចបើកពីលើតាមបណ្ដោយគំនូសសញ្ញាបាន",
      answer2: "ខ- ហាមបើកបរជាន់ ឬឆ្លងកាត់បាន",
      answer3: "គ- អាចបើកបរជាន់ ឬឆ្លងកាត់បាន",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 10,
      question:
          "នៅពេលយប់ក្រៅទីប្រជុំជនគ្មានចង្កៀងអគ្គិសនីបំភ្លឺ យានជំនិះជួបគ្នា តើអ្នកបើកបរត្រូវប្រើភ្លើងអ្វី?",
      answer1: "ក- ត្រូវបិទភ្លើងហ្វា ហើយបើកភ្លើងកុតវិញ",
      answer2: "ខ- ត្រូវបើកភ្លើងហ្វា",
      answer3: "គ- អាចបើកបរជាន់ ឬឆ្លងកាត់បាន",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 11,
      question:
          "តើអ្នកបើកបរត្រូវប្រើភ្លើងអ្វីខ្លះ នៅពេលដែលមានភ្លៀងខ្លាំង នៅក្នុងទីប្រជុំជន?",
      answer1: "ក- ភ្លើងកូត",
      answer2: "ខ- ភ្លើងហ្វា",
      answer3: "គ- ភ្លើងដឺមី",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 12,
      question:
          "គំនូសសញ្ញាភ្លោះជាប់សំរាប់បែងចែកទ្រូងផ្លូវជាពីរទិសចរាចរផ្ទុយគ្នា តើអ្នកអាចបើកបរឆ្លងកាត់ ឬជាន់ពីលើបាន ឬទេ?",
      answer1: "ក- អាចបើកបរពីលើតាមបណ្ដោយគំនូសសញ្ញានេះ",
      answer2: "ខ- អាចបើកបរជាន់ ឬឆ្លងកាត់បាន",
      answer3: "គ- ហាមបើកបរជាន់ ឬឆ្លងកាត់",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 13,
      question:
          "រថយន្តធុនធំមួយ និងរថយន្តធុនស្រាលមួយមានទិសផ្ទុយគ្នា នៅលើទ្រូងផ្លូវតូចចង្អៀត ជៀសគ្នាមិនបាន តើរថយន្តណាមួយជាអ្នកថយក្រោយ?",
      answer1: "ក- ត្រូវអោយយានទាំងពីរថយក្រោយព្រមគ្នា",
      answer2: "ខ- ត្រូវអោយយានធុនធ្ងន់ថយក្រោយ",
      answer3: "គ- ត្រូវអោយយានធុនស្រាលថយក្រោយ",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 14,
      question: "នៅពេលជែងរួច តើអ្នកត្រូវប្រុងប្រយ័ត្នអ្វីខ្លះ?",
      answer1: "ក- ត្រូវបត់ស្ដាំវិញ ដោយប្រញាប់បំផុត",
      answer2: "ខ- មិនចាំបាច់បន្ថយល្បឿនឡើយ ហើយត្រូវបត់ស្ដាំវិញដោយប្រញាប់បំផុត",
      answer3:
          "គ- ពេលជែងរួចត្រូវធ្វើសញ្ញាប្ដូរទិសទៅស្ដាំវិញ ដើម្បីអោយដំណឹងថា ខ្ញុំត្រូវចូលចរន្តចរាចរណ៍ខ្ញុំវិញដោយប្រុងប្រយ័ត្ន",
      correctAnswer: 2,
      category: "General question",
    ),
    Question(
      id: 15,
      question:
          "ផ្លូវខ្វែងមានសិទ្ធិស្មើគ្នា តើអ្នកបើកបរត្រូវទុកសិទ្ធិអាទិភាព អោយយានជំនិះមកពីស្ដាំដៃ ឬមកពីឆ្វេងដៃទៅមុន?",
      answer1: "ក- ត្រូវអោយយានជំនិះមកពីស្ដាំដៃទៅមុន",
      answer2: "ខ- ខ្ញុំអោយយានជំនិះមកពីឆ្វេងដៃទៅមុន",
      answer3: "គ- យានជំនិះមកពីស្ដាំដៃ ឬមកពីឆ្វេងដៃក៏បាន មានសិទ្ធិទៅមុន",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 16,
      question:
          "នៅពេលយប់មានភ្លើងហ្វារថយន្តចាំងពីមុខ តើអ្នកបើកបរត្រូវធ្វើដូចម្ដេច?",
      answer1: "ក- ត្រូវបើកបរក្នុងល្បឿនសមល្មម ហើយបើកអែបស្ដាំបំផុត",
      answer2:
          "ខ- មិនចាំបាច់បន្ថយល្បឿនទេ ព្រោះខ្ញុំទំលាក់របាំងការពារពន្លឺថ្ងៃ ព្រោះខ្ញុំយល់ថាយានមកមុខក៏ឃើញខ្ញុំដែរ",
      answer3: "គ- បើកភ្លើងរថយន្តចាំងខ្លាំង ខ្ញុំត្រូវបើកហ្វាតបទៅរថយន្តនោះវិញ",
      correctAnswer: 0,
      category: "General question",
    ),
    Question(
      id: 17,
      question:
          "រថយន្តមួយកំពុងធ្វើចរាចរលើផ្លូវជាតិ និងរថយន្តទៀតចេញពីផ្លូវលំ តើរថយន្តណាមួយមានសិទ្ធិអាទិភាព?",
      answer1: "ក- រថយន្តចេញពីផ្លូវលំមានសិទ្ធិអាទិភាព",
      answer2: "ខ- រថយន្តកំពុងធ្វើចរាចរនៅលើផ្លូវជាតិមានសិទ្ធិអាទិភាព",
      answer3: "គ- រថយន្តទាំងពីរមានសិទ្ធិស្មើគ្នា",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 18,
      question:
          "តាមបណ្ដោយផ្លូវមានគំនូសសញ្ញាភ្លោះពណ៌លឿង មួយជាប់ និងមួយដាច់ៗ បែងចែកជាពីរទិសចរាចរ ផ្ទុយគ្នា តើអ្នកបើកបរនៅកៀកគំនូសណាមួយអាចឆ្លងកាត់ ឬជែងបាន?",
      answer1: "ក- អ្នកបើកបរនៅកៀកគំនូសជាប់ អាចឆ្លងកាត់ឬជែងបាន",
      answer2: "ខ- អ្នកបើកបរនៅកៀកគំនូសដាច់ៗ អាចឆ្លងកាត់ ឬជែងបាន",
      answer3: "គ- ហាមអ្នកបើកបរឆ្លងកាត់ ឬជែងនៅលើគំនូសដាច់ៗ",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 19,
      question: "តើអ្នកបើកបរយានជំនិះគ្រប់ប្រភេទ ត្រូវជែងគ្នាខាងណា?",
      answer1: "ក- ខាងស្ដាំដៃ",
      answer2: "ខ- ខាងឆ្វេងដៃ",
      answer3: "គ- ខាងណាក៏បាន",
      correctAnswer: 1,
      category: "General question",
    ),
    Question(
      id: 20,
      question: "នៅពេលជួបប្រទះផ្លាកសញ្ញាហាមចត តើអ្នកអាចឈប់បានឬទេ?",
      answer1: "ក- អាចឈប់បាន",
      answer2: "ខ- អាចឈប់បានតែថ្ងៃអាទិត្យ",
      answer3: "គ- មិនអាចឈប់បានទេ",
      correctAnswer: 0,
      category: "General question",
    ),
  ];
}
